driver-tests/jmsbc/JMSBCTests/JMSBCXAXsltJbi/test/JMSBCXAInOnlyTest/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
      <emp:EmployeeInput xmlns:emp="http://sun.com/JMSBCXATest/EmplInput">
          <EmployeeNumber>123</EmployeeNumber>
          <LastName>Doe</LastName>
          <FirstName>John</FirstName>
          <JobTitle>Foo Fighter</JobTitle>
          <HoursWorked>40</HoursWorked>
          <PayRate>40</PayRate>          
      </emp:EmployeeInput>
  </soapenv:Body>
</soapenv:Envelope>